tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "cirruslabs/cli"
tap "facebook/fb"
tap "finnvoor/tools"
tap "getsentry/tools"
tap "homebrew/cask"
tap "mattt/tap"
tap "opencode-ai/tap"
tap "supabase/tap"
# Arduino command-line interface
brew "arduino-cli"
# Download with resuming and segmented downloading
brew "aria2"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# USB programmer
brew "dfu-util"
# Command-line DNS Client for Humans
brew "doggo"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Ping, but with a graph
brew "gping"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI tool for searching and downloading app packages from the iOS App Store
brew "ipatool"
# Utility to optimize JPEG files
brew "jpegoptim"
# Simple terminal UI for git commands
brew "lazygit"
# Securely transfers data between computers
brew "magic-wormhole"
# Quickly generate a temporary email address
brew "mailsy"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Web server scanner
brew "nikto"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Open source computer vision library
brew "opencv"
# PNG file optimizer
brew "optipng"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Identify unused code in Swift projects
brew "periphery"
# PNG image optimizing utility
brew "pngquant"
# Cross-platform library for audio I/O
brew "portaudio"
# Theme for zsh
brew "powerlevel10k"
# Reverse engineering framework
brew "radare2"
# Develop and deploy code with zero configuration
brew "railway"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Command-line packet analyzer
brew "tcpdump"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Metal-powered video upscaling
brew "finnvoor/tools/fx-upscale"
# Supabase CLI
brew "supabase/tap/supabase"
# Utility to add Dynamic Island like features to notch area
cask "alcove"
# Inspect application bundles
cask "apparency"
# Browse/extract images from .car files
cask "asset-catalog-tinkerer"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# App for managing battery charging
cask "batfi"
# Display management tool
cask "betterdisplay"
# 3D creation suite
cask "blender"
# Web security testing toolkit
cask "burp-suite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Collaborative team software
cask "figma@beta"
cask "font-meslo-for-powerlevel10k"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# App to manage software development and track bugs
cask "linear-linear"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Modern GUI for Redis
cask "medis"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Get up and running with large language models locally
cask "ollama-app"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Virtual office
cask "roam"
# Screen recorder and editor
cask "screen-studio"
# Team communication and collaboration software
cask "slack"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Open-source BitTorrent client
cask "transmission"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Gecko based web browser
cask "zen"
mas "AdBlock Pro", id: 1018301773
mas "Amphetamine", id: 937984704
mas "AssetsGen", id: 1616914872
mas "Compose", id: 6744279654
mas "Craft", id: 1487937127
mas "CrystalFetch", id: 6454431289
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "Float", id: 1621142916
mas "Gifski", id: 1351639930
mas "Helm", id: 6479357934
mas "Klack", id: 6446206067
mas "Little Snitch Mini", id: 1629008763
mas "Mockview", id: 1592728145
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "Parcel 2", id: 375589283
mas "PolyCapture", id: 6504193234
mas "Shapr3D", id: 1091675654
mas "TestFlight", id: 899247664
mas "TranslateKit", id: 6476773066
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bradlc.vscode-tailwindcss"
vscode "devine-davies.make-hidden"
vscode "fey.oscura"
vscode "github.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mgwg.light-pink-theme"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ritwickdey.liveserver"
vscode "zainchen.json"
