brew "aria2"
brew "bat"
brew "btop"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "lazygit"
brew "node"
brew "mailsy"
brew "mas"
brew "nmap"
brew "pdm"
brew "periphery"
brew "powerlevel10k"
brew "tree"
brew "wget"
brew "yt-dlp"
cask "alcove"
cask "apparency"
cask "batfi"
cask "betterdisplay"
cask "blender"
cask "burp-suite"
cask "claude"
cask "cleanshot"
cask "cursor"
cask "db-browser-for-sqlite"
cask "figma@beta"
cask "font-meslo-for-powerlevel10k"
cask "font-sf-pro"
cask "iina"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "macs-fan-control"
cask "ngrok"
cask "ollama"
cask "proxyman"
cask "raycast"
cask "rectangle"
cask "screen-studio"
cask "swiftformat-for-xcode"
cask "transmission"
cask "xcodes"
cask "zen-browser"
mas "AdBlock Pro", id: 1018301773
mas "AssetsGen", id: 1616914872
mas "Developer", id: 640199958
mas "Float", id: 1621142916
mas "Gifski", id: 1351639930
mas "Helm", id: 6479357934
mas "Katari", id: 6743736987
mas "Klack", id: 6446206067
mas "Little Snitch Mini", id: 1629008763
mas "TestFlight", id: 899247664
vscode "bradlc.vscode-tailwindcss"
vscode "devine-davies.make-hidden"
vscode "fey.oscura"
vscode "mechatroner.rainbow-csv"
vscode "mgwg.light-pink-theme"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ritwickdey.liveserver"
vscode "zainchen.json"
